// Задача 1. Какое число больше, какое меньше.

Console.WriteLine("Введите первое целое число");
int a = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите второе целое число");
int b = Convert.ToInt32(Console.ReadLine());  
   
    if 
    (a > b)
{
        Console.WriteLine("Первое число больше второго");
}   

    else if (a==b) 
{    
    Console.WriteLine("Числа равны");
}
    else
{
        Console.WriteLine("Второе число больше первого");
}

